{"data":{"markdownRemark":{"html":"<p><span>As the title said, I can’t really messing around that much nowadays. Been busy with work and everything.</span><br>\n<span>My personal project for [MMD x ECO] will be halted for a while.</span></p>\n<p><span>In the meantime, it’s about 70% done,  here’s the summary what I’ve done, starting from the oldest, to the latest.</span></p>\n<p><span>1st Trial:</span><br>\n<span>Using Frapps to capture about 30 seconds of my project, still messed up everywhere. The reason i use this motion is because  it have very minimal movement. My skirt physics is still far from adequate.</span><br>\n<span><br /></span></p>\n<div style=\"clear: both;text-align: center\">\n</div>\n<p><span></span><br>\n<a name='more'></a><span><br /></span><br>\n<span>2nd Trial:</span><br>\n<span>Full version of the above video, not much difference, just fixing physics and weight map, adding physics to my tail, etc.</span></p>\n<div style=\"clear: both;text-align: center\">\n</div>\n<p><span>3rd Trial:</span><br>\n<span>This time, I fully test the motion, camera, physics and such. It’s still incomplete though, I haven’t develop any physics for hair, jabot, ribbon, and such (warning: it spins around quite much =3=)</span></p>\n<div style=\"clear: both;text-align: center\">\n</div>\n<p><span>  </span><br>\n<span>4th Trial:</span><br>\n<span>The last trial I manage to do. It combines the MMD with Augmented reality system. Due to my inexperience in messing around with 3D + AR, the physics is broken. I’m not really experienced about this kind of thing, and unfortunately I don’t have time to work for it anymore due to the workload.</span></p>\n<div style=\"clear: both;text-align: center\">\n</div>\n<p><span>  </span><br>\n<span>Well, that’s about it. </span></p>\n<p><span>Currently I need to learn about Yii framework and WordPress for my job. While at it, there’s good chance I’ll make the Iris section using one of them (most likely WordPress). If you get any work, might as well make it fun, right ? 😀</span><br>\n<span><br /></span><br>\n<span>Regards,<br />~Hourai Etealune~</span><br>\n<span></span><br>\n<span></span></p>","frontmatter":{"title":"Project Etealune Halted, busy for work :("}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2012-03-14-project-etealune-halted-busy-for-work/","layout":"post"}}