{"data":{"markdownRemark":{"html":"<p> </p>\n<h4>Updated version: 13 April 2014</h4>\n<p>Since most of non-japan Emil Chronicle Online got closed, I got a swarm of ppl asking on how to play on eco jp. Well it’s not that hard to register and play, but nevertheless, not easy either.</p>\n<div style=\"clear: both; text-align: center;\">\n  <a style=\"margin-left: 1em; margin-right: 1em;\" href=\"http://hourai.etealune.net/wp-content/uploads/2012/09/screenshot.13-04-2014-21.18.21.png\"><img src=\"http://hourai.etealune.net/wp-content/uploads/2012/09/screenshot.13-04-2014-21.18.21.png\" border=\"0\"></a>\n</div>\n<p><a name=\"more\"></a></p>\n<h2>1. General Guidelines</h2>\n<p>Please note that you’re playing this illegaly, don’t use any other language except japanese on open chat (party/ring chat is ok) if you (and the rest of us) don’t want to get banned it’s okay to chat using english in party consisting indonesian which you know, but not in open, you’ll get banned and most possibly drag us along like thailand accident before in ECOID.</p>\n<h2>2. Requirements</h2>\n<p>You’ll need to prepare few things to be able to play ECOJP, below i’ll list what you to install along with the usage later:</p>\n<ul>\n<li><a href=\"http://cldownload.gungho.jp/eco/ECO_SETUP.exe\">ECOJP client</a></li>\n<li>Firefox or Chrome</li>\n<li>Japanese IME (optional, built in along with windows) OpenVPN/SoftEther (optional, needed incase primary connection method didn’t work)</li>\n</ul>\n<h2>3. Installing VPN</h2>\n<p>There are many ways to access japanese server but the simplest option is using softether service, but cost at a little bit higher ping rate (around 2 times higher pings, depending on where you are). If you’re an absolute noob when it comes to setting up things and don’t want hassle to change ip every weeks or so, use softether method, for advanced bunch, use L2TP.</p>\n<h4>Method 1: Using SoftEther VPN</h4>\n<div style=\"clear: both; text-align: center;\">\n</div>\n<p>VPNGate SoftEther download site: <a href=\"http://www.vpngate.net/en/download.aspx\">http://www.vpngate.net/en/download.aspx</a><br>\nYou’ll need to download and install SoftEther VPN Client</p>\n<ol>\n<li>When installing, choose SoftEther VPN Client.</li>\n<li>After finished, open the programs, click on “VPN Gate Public VPN Relay Servers”</li>\n<li>There will be several DDNS Hostname, to play eco, pick one that come from japan region, and high session.</li>\n<li>Use TCP protocol to connect</li>\n<li>When asked, pick option to install this software, this is normal, and it will create a new connection for you</li>\n<li>Wait a little bit and then there will be a message that you already connected to VPN</li>\n</ol>\n<h4>Method 2: Using OpenVPN method</h4>\n<div style=\"clear: both; text-align: center;\">\n</div>\n<p>OpenVPN site: <a href=\"http://openvpn.net/index.php/open-source/downloads.html\">http://openvpn.net/index.php/open-source/downloads.html</a><br>\nVPNGate site: <a href=\"http://www.vpngate.net/en/\">http://www.vpngate.net/en/ </a><br>\nYou’ll need to download OpenVPN for 32 bit or 64 bit windows from OpenVPN Site given above.</p>\n<ol>\n<li>You need to look for Japanese Country VPN. Look for row with Japanese Country and they support OpenVPN. I recommend using one from tsukuba.</li>\n<li>Click on OpenVPN Config file row, and download the link which use TCP. Take note of their configuration file will change every 2 week. If this happens you’ll be unable to connect and need to change the configuration file.</li>\n<li>Install the OpenVPN, if asked, choose to trust and install the OpenVPN.</li>\n<li>After finishing install, copy the configuration files into OpenVPN config folder, Usually, it will be on C:Program FilesOpenVPNConfig</li>\n<li>Run the OpenVPN GUI as Administrator</li>\n<li>While it doesn’t show anything, there will be a small icon in the system tray, that will be your OpenVPN program.</li>\n<li>Right click on the icon, and choose “connect”</li>\n<li>Wait a little bit and then there will be a message that you already connected to VPN</li>\n</ol>\n<h4>Method 3: Using L2TP Service</h4>\n<div style=\"clear: both; text-align: center;\">\n</div>\n<p>VPNGate site: <a href=\"http://www.vpngate.net/en/\">http://www.vpngate.net/en/</a><br>\nYou’ll need to for Japanese VPN at the site given above.</p>\n<ol>\n<li>You need to look for Japanese Country VPN. Look for row with Japanese Country and they support L2TP/IPsec. I recommend using one from tsukuba. Take note of their IP Address (number with xxx.xxx.xxx.xxx format)</li>\n<li>Go to control panel, enter network and sharing center -> set up new connection -> connect to workplace -> use my internet connection (VPN).</li>\n<li>Fill the Internet address with IP address on the step 1. You can use any name for Destination name.</li>\n<li>If you are asked for username and password, use “vpn” for both username and password, all lowercase letter. Do not connect yet.</li>\n<li>Go to “Network and Sharing Center” and click “Change adapter settings”</li>\n<li>The currently defined VPN connection settings you made are listed here. Right click the icon you created in the previous step, and click “Properties”</li>\n<li>On the Properties screen, switch to the “Security” tab. (In Windows XP, switch to the “Network” tab.) Choose “Layer 2 Tunneling Protocol with IPsec (L2TP/IPSec)” on the “Type of VPN” drop-down list.</li>\n<li>Below the Type of VPN, there’s advanced menu, click on that and set preshared key with “vpn” – all lowercased letter.</li>\n<li>After the above configuration finished, click the “OK” button twice to close the property screen of the VPN connection setting.</li>\n<li>Now you have set the VPN, to activate it you will need to access the taskbar, right click on your connection, and then use the VPN you just created</li>\n</ol>\n<h4>Method 4: Using Tsunagarumon</h4>\n<div style=\"clear: both; text-align: center;\">\n</div>\n<p>Tsunagarumon site: <a href=\"http://tsunagarumon.com/entry/\">http://tsunagarumon.com/entry/</a><br>\nYou’ll need to register for VPN at the site given above.</p>\n<ol>\n<li>On the page given above, the page will ask your email. Just write your email, tick the agreement box, and click the pink button.</li>\n<li>You’ll get notification regarding an email being sent to your address, so open your email now. You’ll see an email from Tsunagarumon regarding registration verification.</li>\n<li>You’ll be redirected to page which state that you’re successfully registered, and got your ID/password for VPN Connection.</li>\n<li>Check your email again, this time they will send you an email which have 3 important thing listed: ID, Password, and “host address”</li>\n<li>Go to control panel, enter network and sharing center -> set up new connection -> connect to workplace -> use my internet connection (VPN)</li>\n<li>Fill the Internet address with 49.212.48.199. In your mail you are given 49.212.0.54 for the address, but this one is slower.</li>\n<li>Use any name for the destination name. You can just use “Tsunagarumon” or something.</li>\n<li>If you’re asked for ID/Password, use the detail you were given in your mail. ID is usually your email, and password is the line below it.</li>\n</ol>\n<h2>4. Registering ECOJP and Starting the Game</h2>\n<div style=\"clear: both; text-align: center;\">\n</div>\n<p>Registration Page: <a href=\"https://member.gungho.jp/front/register/eco/entry.aspx\">https://member.gungho.jp/front/register/eco/entry.aspx</a><br>\nClient Download: <a href=\"http://cldownload.gungho.jp/eco/ECO_SETUP.exe\">http://cldownload.gungho.jp/eco/ECO_SETUP.exe</a><br>\nYou’ll need to register at the registration page given above. If you have set your VPN correctly, you’ll be redirected into signup page, but if not you’ll get “non Japanese are not allowed since you can’t pay”. In the case this is happens, something wrong happened with your VPN, use another method listed until you can access the registration page.</p>\n<ol>\n<li>First thing first, it will ask your email. Just write your email and click the accept button below (big orange button thingie)</li>\n<li>You’ll get notification regarding an email being sent to your address, so open your email now. You’ll see that GungHo have emailed you something, if not, just wait a little bit</li>\n<li>You’ll be redirected to page with some field to be filled, Leave the first field, username on the second field, password on the 3rd and 4th field, your birthday on 5th fields and captcha on last field. You need Japanese IME to fill this form.</li>\n<li>Run your ECO jp, it will open IE (yes, you’ll need IE to play, sadly) look at the lefthand side, this is where you input your username and password.</li>\n<li>Sometimes the captcha page will appear, just fill it and press accept, you can copy paste on this one so just fill it away.</li>\n<li>You’ll get back to the main page, but the left sidebar has been changed, there’s dropdown there, pick your ID to be able to play.</li>\n<li>If this is your first time playing, there will be popup asking to install LoadPrgAx.CAB or something to your computer. This is a must, just install it away to be able to play.</li>\n</ol>\n<p>Installing Japanese IME:</p>\n<ol>\n<li>Go to the control panel by clicking on the start menu</li>\n<li>Choose “Change keyboard or other input methods” , or “region and language”, depending on what kind of view your control panel is using</li>\n<li>Select “Change keyboards”</li>\n<li>Click “Add”</li>\n<li>Scroll down to see “Japanese”, and open the dropdown by clicking the little [+] symbol on the right of Japanese (Japan) and then tick the “Miscrosoft IME” Checkbox</li>\n<li>On the second tab, “Language bar”, make sure you have “Docked in the taskbar” and “Show text labels on the Language bar” checked</li>\n<li>You now have enabled IME, and will see little EN on the bottom on the right of your screen</li>\n<li>To use it, when you’re opening your IE (preferably on captcha textbox), click the EN button on the taskbar, and change it to JP Japanese, and then change the output to hiragana</li>\n<li>Now you can write in Japanese using romaji input, if you don’t know what the captcha said, please refer to wikipedia and match letter with their romaji and type it away.</li>\n</ol>\n<p>That’s all. Next thing to do is to install the update patch, which many people failed to do so due to huge file to download, but just try again if you’re stuck with patcher. If there’s anything unclear, just comment below. I’ll answer with the best I can. if you can send SS about your trouble, that will be great.</p>\n<p>Regards,<br>\n~Hourai Etealune~</p>","tableOfContents":"<ul>\n<li>\n<ul>\n<li>\n<ul>\n<li><a href=\"/post/2012-09-07-how-to-play-ecojp/#updated-version-13-april-2014\">Updated version: 13 April 2014</a></li>\n</ul>\n</li>\n</ul>\n</li>\n<li><a href=\"/post/2012-09-07-how-to-play-ecojp/#1-general-guidelines\">1. General Guidelines</a></li>\n<li><a href=\"/post/2012-09-07-how-to-play-ecojp/#2-requirements\">2. Requirements</a></li>\n<li>\n<p><a href=\"/post/2012-09-07-how-to-play-ecojp/#3-installing-vpn\">3. Installing VPN</a></p>\n<ul>\n<li>\n<ul>\n<li><a href=\"/post/2012-09-07-how-to-play-ecojp/#method-1-using-softether-vpn\">Method 1: Using SoftEther VPN</a></li>\n<li><a href=\"/post/2012-09-07-how-to-play-ecojp/#method-2-using-openvpn-method\">Method 2: Using OpenVPN method</a></li>\n<li><a href=\"/post/2012-09-07-how-to-play-ecojp/#method-3-using-l2tp-service\">Method 3: Using L2TP Service</a></li>\n<li><a href=\"/post/2012-09-07-how-to-play-ecojp/#method-4-using-tsunagarumon\">Method 4: Using Tsunagarumon</a></li>\n</ul>\n</li>\n</ul>\n</li>\n<li><a href=\"/post/2012-09-07-how-to-play-ecojp/#4-registering-ecojp-and-starting-the-game\">4. Registering ECOJP and Starting the Game</a></li>\n</ul>","frontmatter":{"title":"How to play Emil Chronicle Online – Japanese Server","url":"/blog/how-to-play-ecojp/"},"fields":{"path":"/post/2012-09-07-how-to-play-ecojp/"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2012-09-07-how-to-play-ecojp/","layout":"post"}}