{"data":{"markdownRemark":{"html":"<p>First off, Sorry for -extremely- late post on this item. I finally get this item a two ago, but has no chance of posting it due to my holiday where I can’t get touch with internet. Nevertheless, I have to end what I have started, so no matter how late it is (3 weeks late >.&#x3C;), I think I should review this</p>\n<p>Here’s the detail:<br>\nit adds 3 character, namely Hayate, Vita, Nanoha Striker’S, Mission Mode, 3 new maps (which I don’t know how to unlock), and changed main menu.</p>\n<p><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/Title.jpg\"><br>\nNew Title screen</p>\n<p>For the new Character; Do note that I’m not using official name for it, just using the name of skill which I vaguely remember from the anime. also, different from my standard writing, the pic will represent writing above it, not below it.</p>\n<p>Hayate (clear mission 10 in mission mode to unlock).<br>\nSkill:<br>\nA: Atem des something – still don’t know the pronounciation. Decent AOE, Freeze the enemy if hit. Quite an useful skill.</p>\n<p><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/IceCube.jpg\"><br>\n<img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/icycube2-1.jpg\"> </p>\n<p>B: Hræsvelgr, Decent damage, making a line like Divine Buster or such, but can’t be controlled, it has bigger AOE though.</p>\n<p><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/Hreasvelgr.jpg\"> </p>\n<p>C: Mysteltain, Basically binding skill that turn your enemy into stone. May miss if your enemy keep moving.</p>\n<p><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/Mystelltain.jpg\"> </p>\n<p>SP1: diabolic emission, Fast casting, Very Big AOE, Very good, I’d say.</p>\n<p><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/Diabolicems.jpg\"> </p>\n<p>SP2: ragnarok, with Nanoha and fate as backup. I Never tried it against other player, but if you use it in Training mode, it will damage about 3.5 bar of health (and opponent’s life won’t regenerate). If same condition applies to normal battle, then consider yourself dead after getting hit by this.</p>\n<p><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/Rbreakercopy.jpg\"> </p>\n<p>PS: She can’t do Quick Dash. Never use her if you have no friend to back you up, worse if your enemy excels at pinning spellcaster down (ex: SArara, Kirara).</p>\n<p>Vita (clear mission 20 in mission mode to unlock)<br>\nA: Rocket Hammer (?). She spins her hammer. Does a circular spinning, Might be good, might be useless, depending on your position.</p>\n<p><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/VitaA.jpg\"> </p>\n<p>B: I have no Idea What is this, she create 4-8 Ball (depending on how long you charge it) to be smashed onto enemy. Useless skill, if I may say, there’s too much casting time. </p>\n<p><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/Vitab.jpg\"> </p>\n<p>C: No idea either… damn, I can barely know engrish, but what language is this? She shoot several bullet, creating circular motion around him for a few second, much more like a blast for me.</p>\n<p><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/VitaC.jpg\"> </p>\n<p>SP1: Gigant Hammer Form, Gigant Crusher (Mole smacking time :D), She swing it around before smashing the enemy. Note that the swing also induces damage.</p>\n<p><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/GCrusher.jpg\"> </p>\n<p>SP2: Angry rocket Hammer. What to say… she shot a bullet, which will be countered by your character, after that she seems enraged and charged unto you using her A Special.</p>\n<p><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/Vitasp21.jpg\"><br>\n<img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/VitaSP22.jpg\"> </p>\n<p>Nanoha StrikerS<br>\nA: ACS Charge, A charging attack to your enemy, not a bad move, but pretty mediocre, I think.</p>\n<p><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/ACScharge.jpg\"> </p>\n<p>B: Divine Buster, This one is different with Nanoha’s in usage. You don’t need to charge it at all and the damage will vary depending on how many funnel/ at what mode you use (see C).</p>\n<p><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/Dbuster.jpg\"> </p>\n<p>C: Blaster. blaster one, blaster second, and blaster three respectively. Increase the damage from Divine buster in compensation for your life (it drains your life gradually).</p>\n<p><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/Blaster3.jpg\"> </p>\n<p>SP1: Starlight Breaker + Break Shoot, HUGE AOE. You’ll know how big it is if you have faced 3 of it.</p>\n<p><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/Sbreaker.jpg\"> </p>\n<p>SP2: Crossfire. It’s the one that she used to teach Teana a lesson, quite good, IF there’s no subaru’s sound stopping Nanoha in the end.</p>\n<p><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/Cfire.jpg\"> </p>\n<p>Well, that’s it, I Haven’t get everything myself (I had finished all of misson but haven’t get any maps), If someone know how to, please notify me, thanks.</p>\n<p>Some Credit goes to Wheat, for his previous comment in previous post.</p>","frontmatter":{"title":"Magical Battle Arena- Lyrical Pack"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2009-01-21-magical-battle-arena-lyrical-pack/","layout":"post"}}