{"data":{"markdownRemark":{"html":"<p>Today I’m attending a fair located at Pakuwon Trade Center, Surabaya.<br>\nNot much to say, but I’m quite dissapointed with this one……</p>\n<p>Like Malang’s toy &#x26; comicfest was not bad enough, this is worse than that, a very small stage, nothing special, and I didn’t find even a single thing that will entertain me.</p>\n<p>Well, I was there with my friends, so It’s not really that boring, but still I think that it’s not good enough to make me excited in anyway. Not to mention that I have no more money left…. poor me.</p>\n<p>anyway, one of my friend in Bali asked me to get Keroro Gunsou’s keychain (Similar to the one that’s used by Tsukasa at Lucky Star does), 2.5 US$ each….</p>\n<p><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/DSCN3038_sm-1.jpg\"> </p>\n<p>I myself went and buy a very cheap, unknown item at 4$ (okay, look, I have no money to buy anything, even 4 US$ is killing me at this time). Nothing special, I just always buy something from every event I attend as a mean of keepsake.<br>\n<a href=\"http://i485.photobucket.com/albums/rr211/Hourai/Untitled-3.jpg\"><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/Untitled-3ss.jpg\"></a><br>\nnot bad for a 4$ thing </p>\n<p>And that’s it, I’ll add more thing later, and probably tomorrow too……</p>\n<p>Edit:<br>\nI forgot to (re)mention this, but I AM NOT A PHOTOGRAPHER BY ANY MEANS. I only give a picture i take as representative of what I’m writing at that time. So don’t go mailing me about how bad my pic were taken (I get several regarding this blog…)</p>\n<ol>\n<li>\n<p>I’m using a Nikon Coolpix 5200, an old, pocket camera, which can easily be surpassed even by Handphone’s built in camera. And no, I don’t have SLR camera or such.</p>\n</li>\n<li>\n<p>I’m only using photoshop just for rescaling and cropping the pic, the image itself is as is, and I’m not using any image enhancement to modify it. No brightness change, no noise reduction, etc.</p>\n</li>\n</ol>\n<p>Ok, that’s it, I love to collect AF’s but I have almost no interest in taking photo of that. I have almost no interest nor talent in photography to begin with.<br>\nMy blog is not the place where I post about photography, Just go somewhere else if you want it. This is not the place.</p>","frontmatter":{"title":"Toymagz Fair : day one"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2008-12-05-toymagz-fair-day-one/","layout":"post"}}