{"data":{"markdownRemark":{"html":"<p>Sorry for not posting for a whole month, I’m busy…<br>\n…<br>\n…<br>\n…<br>\n…<br>\nOk, that’s a total lie. I don’t even have anything else to do other than playing games recently.</p>\n<p>So here I am, playing project diva, using my friend’s psp (no, I don’t have one).</p>\n<p>Well, Many of you have already played this game, I myself got the game 2 days before it’s release date, but I don’t have any luxury to play it as much as i like.</p>\n<p>This game is a rhythm game, much like DDR mixed with some idolm@ster dance.</p>\n<p><a name='more'></a></p>\n<p> <span><br />This game consist of 36 playable songs on it’s free play” section, every song has “mark” or “tag”, represented by color. There’s 6 color, namely pink,blue,orange,yellow,sky blue, and white. There’s 5 song in each tag set, with exception for yellow(9 songs), and white (7 songs)</p> </p>\n<p>\n  Also, this game also featuring many costumes (53), this also includes Megurine Luka, Rin/Len, and even Yowane Haku, Akita Neru, and Kaito.\n</p>\n<p>\n  One thing that really make this game interesting is that you can create custom songs on your own, much like an editor, including what keys to be pressed, it&#8217;s sequence, etc,etc. Needless to say, you are free to set what kind of action your vocaloid will perform. There&#8217;s already a few (or many) custom song at http://loda.jp/mikudiva/\n</p>\n<p>\n  Ahem, now to the game, It&#8217;s basically a like DDR, if you have ever played that, but instead of direction arrow, you use Triangle/circle/X/square button, and sadly, you can&#8217;t interchange it with directional button., so It&#8217;s more like your right hand do all the work and your left hand sitting idle doing nothing. Your screen will display what button that you need to press with something like clock hand at specific place, and the matching button flying across screen. What you need to do is press the button exactly when the clock hand reach 1200 or the flying coloured button overlaps stationery button. Every hit you make worth some pint and there&#8217;s an extra point if you can make a combos of &#8220;fine&#8221; or &#8220;cool&#8221; condition (equal to &#8220;great&#8221; and &#8220;perfect&#8221; in DDR). There&#8217;s also a chance time, a time where every combo you make can give you crazy extra points if it connects (it&#8217;s likely more than half of the game&#8217;s point are from this chance time frame)\n</p>\n<p>\n  Well, after finishing it, you get your grade, MissxTake, refer to failed songs, this is happens when you can&#8217;t keep up with songs and forced to leave the game before it&#8217;s ended. Cheap, when you manage to beat a songs but have not enough points to pass. standard, well, standard, you just barely pass. Great, like the name implies, you passed with points higher than it should and perfect&#8230; well, perfect, not even a single note you do is below &#8220;fine&#8221;.\n</p>\n<p>\n  There&#8217;s also costume&#8230; well, It&#8217;s the costume that you use for your Miku (or other character), each with some specific requirements for it. Some are easy to get, and the others are freaking hard (not really hard, actually, just need quite a few trials).\n</p>\n<p>\n  There&#8217;s also Miku&#8217;s room, for, I dunno what XD, and gallery for screen. Well, that&#8217;s pretty much it. You can get the picture to your memory stick by pressing R buttons. Well, here&#8217;s some screenshot that I take.\n</p>\n<p>\n  <img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/PJD_0006.jpg\"><br>My Favorite Costume &lt;3 labeled as &#x201C;snow&#x201D; <img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/PJD_0015.jpg\">\n</p>\n<p>\n  <img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/PJD_0020.jpg\">\n</p>\n<p>\n  <img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/PJD_0035.jpg\">\n</p>\n<p>\n  <img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/PJD_0041.jpg\">\n</p>\n<p>\n  <img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/PJD_0046.jpg\">\n</p>\n<p>\n  <img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/PJD_0048.jpg\">\n</p>\n<p>\n  <img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/PJD_0054.jpg\"><br>Yowane Haku&#x2026; yes, you can use her.\n</p>\n<p>\n  <img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/PJD_0058.jpg\">\n</p>\n<p>\n  <img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/PJD_0059.jpg\">\n</p>\n<p>\n  And sorry, but for now, I can&#8217;t give you any screenshot of the playing screen (Too lazy to search a way to do it). Video is also a bit out of question, sega remove every project diva&#8217;s video (and ban the user)except the official one at Youtube\n</p>\n<p>\n  I already get all the songs, but only half the costumes, well, I&#8217;ll do the unlocking job when I have <s>time</s> *cough* motivation to do so.\n</p>\n<p>\n  Overall, this is a great game, and have a great song sets to boot (I even amazed that the first playable song is my favorite, &#8220;World is Mine&#8221; by Ryo/Supercell), also, the potential of custom songs are not something to be overlooked at.<br /></span>\n</p>","frontmatter":{"title":"Hatsune miku: Project Diva"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2009-07-06-hatsune-miku-project-diva/","layout":"post"}}