{"data":{"markdownRemark":{"html":"<p>Ok, just for random thought of this day. I was surprised that out of my class, only 1-2 people know about burn-in for earphones/headphones/speaker.  </p>\n<p>Burn-in is, roughly speaking, to maximize your earphones/headphones/speaker's sound by wore it off... something like, you have a new pair of shoes... at the time of first using it, it will feel kind of stiff. you must wear it for some time that it will have the flexibility and comfortability in using it. This is the same with your earphones/headphones/speaker. At first they may sound good, but that's it. It's still new out of box. It's capability haven't maximized because the membrane (one that produce sound) is still stiff.  </p>\n<p>Burn-in procedure is quite easy, but maybe boring. You just need to use your earphones/headphones/speaker for a long time (most earphones/headphones/speaker use more than 100+ hour), using sound as loud or a bit more than you usually heard.Setting the sound too high will destroy your earphones/headphones/speaker, and too low won't make any progress to your burn-in. Some people will use their favorite song to burn it, others will use some kind of noise, the most popular one is White and Pink noise. I myself using pink/white noise most of the time. But, for some people, they will find that using that kind of noise will make the sound feel \"unnatural\", that's differ from each person, though, since everything about sound and music are very subjective matter of like/dislike.  </p>\n<p>As far as I know, there's no science that proof whether this is true or false. Some people even said that burn-in didn't affect the performance of earphones/headphones/speaker at all, some said otherwise. For me, it works quite wonders. Then, once again, this depend solely on your ears, not mine.  </p>\n<p>Oh, and burning speaker is kind of sucks... I never do that.I'm only do burn-in to my earphones/headphones. Burn-in speaker using pink/white noise inside my room for 200++hour will drive me crazy.  </p>\n<p>You can download pink/white/ any other generated sounds used in burn-in at www.Burninwave.com. It also has some explanation about what kind of sound it will generate and what will be affected by it.</p>","tableOfContents":"","frontmatter":{"title":"Burn-in","url":null,"date":"2008 November 16"},"fields":{"path":"/post/2008-11-16-burn-in/"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2008-11-16-burn-in/","layout":"post"}}