{"data":{"markdownRemark":{"html":"<p>Nothing to do, which make me frustated, since i’m not used to it.<br>\nWell, since I’m extremely bored, I’ll just make a review of my gadget, this time it will be an IEM (In Ear Monitor)<br>\nIf you think it looks like a “certain IEM”, well, this one is made in Indonesia, so there’s a high chance you’re mistaking it >:), this thing is priced 218000 IDR (roughly USD 20$)</p>\n<p>Packaging Includes (as written in the box):<br>\n-Earphone<br>\n-Hard Case<br>\n-3 Pairs of Ear Tips (S/M/L)<br>\n-Cable Winder<br>\nWell, after I open the box the packages also include:<br>\n-1 Pair of Bi-flange tips (medium sized)<br>\n-Manual paper (English/Indonesian language)<br>\n-Warranty paper<br>\n-A paper explaining about hearing impairment (English/Indonesian language)</p>\n<p>Specification:<br>\nDriver: 9mm Neodymium Magnet Speaker<br>\nImpedance: 12 ohm +/- 10%<br>\nCable Length : 1.2 Meter<br>\nFrequency response: 20 HZ- 22KHZ<br>\nPlug: 3.5 mm-gold plated</p>\n<p>It’s hardcase is small and elegant with a dbE acoustic symbol in front of it made of plastic and steel (for the writing). The badge appear to be cutted, but it actually like that on the first place. Nothing much to say here.</p>\n<p><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/Case.jpg\"><br>\nhard case… The badge appear to be cut</p>\n<p>There are 4 kinds of flange included: small,medium, Large, and bi-flange. I myself using med-sized flange. The tips size of this IEM (PR18) is standard, so you can replace the flange with UE/X3i/ RE1/ AT/ Sony/ Panasonic ‘s flange.</p>\n<p><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/flange.jpg\"><br>\nTips, left to right, Small, Medium, Large, Bi-flange</p>\n<p>Moving to the earphones, the connector size is quite small, and can be fit into iPhone’s. in the mid of cord, before the Y sector, there’s a clipper with ‘dbE’ written on it. This is used for lessening microphonic issue that an IEM has. In The Y sector, there’s a cylinder enclosure (which also has dbE written on it). for the bud, the outer layer is made from steel, not a cheaply chromed plastic like many others done. In the connection between bud and cord, there’s a small writing that symbolize L/R , which represents which bud enter which ear. the driver is protected with metalic grill and not replaceable.</p>\n<p><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/IEM.jpg\"><br>\n<img src=\"http://i485.photobucket.com/albums/rr211/Hourai/Clip.jpg\"><br>\nBud, Clip, and Y section</p>\n<p>Okay, time to test-driving this item.</p>\n<p>Source: Sony NWZ-E435F; Sandisk sansa clip<br>\nSong used:</p>\n<pre>Forest306 - 東方阿漕集<br />Track 03 - フォールオブフォール (Fall of Fall) - VBR<br /><br />=NeutraL= - Acoustic Shooter<br />Track 08 - 無何有の郷 ～ Deep Mountain (Utopia ~ Deep Mountain) - VBR<br /><br />オーライフジャパン - 東方温泉祭<br />Track 01 - 好奇心優先 (Curiosity Preference) -VBR<br /><br />記憶～MAIKAZE music works～<br />Track 07 - 散りゆく時(piano version) (scattering time) - 320 CBR<br /><br />神樂 ～KAGURA～<br />Track 03 - 鬼友達 (Demon Friend) - 320 CBR<br /><br />神樂 ～KAGURA～<br />Track 06 - 里帰り (visiting one's parents / new bride's first visit to parents ) - 320 CBR<br /><br />永夜の理<br />Track 04 - 小さな屋敷小さなメイド (small mansion, small maid) -VBR<br /><br />マクロスF ボーカルコレクションアルバム Vocal collection Album「娘たま♀」<br />Disc 2 track 11 - トライアングラー(fight on stage) (Triangle (Fight on the stage)) - 320 CBR<br /><br />マクロスF ボーカルコレクションアルバム Vocal collection Album「娘たま♀」<br />Disc 1 Track 12 - ねこ日記 (cat's Diary) - 320 CBR</pre>\n<p>I’ll skip commenting each song, here’s the result.</p>\n<p>Soundstage: Mediocre, not that special, it does it’s job at rendering 3D’s sound but lack of layer. I can tell from where the sound is coming but I can’t tell how far/near it is compared to the other instrument.</p>\n<p>Bass: good, coloured, not tight enough, but very fun to be listened,I love this point &#x3C;3, It enters bass section a bit too early, though, so if someone is playing guitar bass the mid will be overwhelmed by it.</p>\n<p>Mid: I separate this into 2 section, Higher mid and lower mid. The lower mid is overwhelmed by bass, and the higher mid is kind of sharp and edgy.</p>\n<p>Treble: smooth, but since treble is usually following high mid, it’s not as good as it is.</p>\n<p>Detail : Mediocre, I’d say. The lower mid are overwhelmed by bass, but after that it’s quite good.</p>\n<p>and that’s before it’s burned in. after burning in there’s a significant change:</p>\n<p>The bass become more punchy, not bloated at all, it knows where the bass are supposed to be.<br>\nMids become smoother, the edgy sound in the higher mid is smoother, and since the bass were not bloated anymore, lower mid is not being overwhelmed.<br>\nIt’s treble now pack quite a lot of detail, a bit analytic but that’s fine. I love analytic sound (my ER6, long gone)</p>\n<p>When paired with Fiio E5 (headphone amp);if without bass boost I’d say this thing will sound worse. It’s like this thing will have cuted bitrate (downgrade in detail). If you use the bass boost, this will make the bass crazier, which i find it to be too much. I prefer unamped much better.</p>\n<p>Overall, this is a really good IEM considering i’t only about USD 20$’s, while not perfect (Nothing does, IMO) this IEM will crush most item below 50$ mark. It’s worth of an item that you can call it steal.</p>","frontmatter":{"title":"Review: dbE Acoustic PR18"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2009-01-21-review-dbe-acoustic-pr18/","layout":"post"}}