{"data":{"markdownRemark":{"html":"<p>It's been one year since I updated anything at all. While 99% of the reason I did not update the site is mostly because of the laziness, I decided to fill it up again (yeah, I do promise it several times, but always fail to fulfill it).</p>\n<h2 id=\"underlying-problem\"><a href=\"#underlying-problem\" aria-label=\"underlying problem permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Underlying Problem</h2>\n<p>Now for the content: I decided to upgrade this website using Gatsby due to many problems I had with Wordpress, which is mainly about the flexibility to do what I want (in term of page design). Sure, Wordpress has a lot of themes that you can use but there are a few problems that I encounter:</p>\n<ol>\n<li>I can't find a suitable theme that suits both my taste and have enough \"features\" to keep up with my need. Heck, I can't even find one that fully suits my taste design-wise without compensating anything, and I haven't even considering the features yet.</li>\n<li>It runs on PHP, which is okay for a dynamic site despite quite old (and a bit slow, even more so when dealing with \"WordPress\"). Since my primary usage is to write blog content which only needs static content, with the exception for the search function and commenting function, I can afford to use some kind of static website preprocessor and publish it.</li>\n<li>WYSIWYG editor, while nice for most people without technical skill, is not doing any good for me. It often creates unnecessary elements (such as empty <p> block, etc) and I can't write a formatted \"draft\" without going to their WYSIWYG editor. Since I usually write a post in plain text (usually on google keep when I'm on commute) and fix that later after being home, MarkDown is a better choice considering the fact that I can just write my draft on any notes taking app, and I can format them at the same time, without any need to wait to format it using WordPress's WYSIWIG editor. </li>\n</ol>\n<h2 id=\"solution\"><a href=\"#solution\" aria-label=\"solution permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Solution</h2>\n<p>Sure, if I code the themes myself and get the correct plugins I can make it happens. But it will not help with problem #2 at all. This is where Gatsby comes in:</p>\n<ol>\n<li>It is a framework based on React to create a static website. As far as I'm concerned, a static website is faster than their dynamic counterpart, there's no way around that. They also handle images with lazy loading, compression, optimization, and whatever they need to make image loads faster (which I have a lot on my page)</li>\n<li>I can remove whatever security features needed by WordPress since you don't need to deal with any of security bullshit when dealing with a static website, which also makes it simpler and faster.</li>\n<li>Gatsby can easily make Single Page Application with seamless animation when switching between page (they only reload elements which differs from the previous page), which opens up a lot of new possibilities to do animation (in particular, animation when the page is changed). This is my primary reason to choose this framework.</li>\n</ol>\n<h2 id=\"next-step\"><a href=\"#next-step\" aria-label=\"next step permalink\" class=\"anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Next Step</h2>\n<p>So what's next? When I deployed this site, it is more or less only a Minimum Viable Product, so there's a lot of feature and pages that I want but still not here yet. </p>\n<ol>\n<li>As of now, I'm using Commento as the comment service provider. However, all of my exported comments lost its author which is a dealbreaker in my scenario. Besides, it is quite unstable which makes me deters from continuing to use it. Their track record of keeping the server alive is bad, at the very least. I am planning to look for other providers.</li>\n<li>It is about time to update the Live2D scripts that I used since several years ago. It still works well, but now there's Live 2D version 4.0 and new web SDK which might be better than the makeshift solution that I use for now.</li>\n<li>If you notice, there is a \"sandbox\" page which I plan to keep all of my \"for fun\" project as a gallery of some sort (which I don't have one, currently). Since I still don't have any idea on what should I do with this page, I will leave it blank for now. This will be hard to do since my project will be scattered across multiple languages or subjects, and probably need a dedicated page detached from the main site. We'll see what I can do to deal with this page later.</li>\n</ol>\n<p>I will try to keep posting once a week with whatever topic I want to write, so this blog will be more of a diary than an actual informative blog. There will be no fixed themes to this blog, so if you want consistency, you should not be here, to begin with. If you happen to have the same hobby as mine (programming, wasting money for useless gadgets, etc) then feel free to hang around. That's all for now.</p>\n<p>PS: If you see the post number is not consistent, it simply meant that there are some posts that I decided to delete since it was either not relevant anymore (ex: I promote one of my sites, but I have taken it down), or simply it super bad that I feel like to just remove it.</p>","tableOfContents":"<ul>\n<li><a href=\"/post/2019-09-14-website-upgrade/#underlying-problem\">Underlying Problem</a></li>\n<li><a href=\"/post/2019-09-14-website-upgrade/#solution\">Solution</a></li>\n<li><a href=\"/post/2019-09-14-website-upgrade/#next-step\">Next Step</a></li>\n</ul>","frontmatter":{"title":"Website Upgrade","url":"/blog/website-upgrade/","date":"14 September 2019"},"fields":{"path":"/post/2019-09-14-website-upgrade/"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2019-09-14-website-upgrade/","layout":"post"}}