{"data":{"markdownRemark":{"html":"<p>5 days ago, Tasofro announce that there will be touhou 12.3 in this comiket 76 (It’s in August, in case you forgot)</p>\n<p><img src=\"http://www.tasofro.net/touhou123/img/th123_j.jpg\"> </p>\n<p>And yeah, actually I’m posting far too late, thanks for my ⑨ grade internet. I can’t even open anything else than messenger.</p>\n<p><a name='more'></a></p>\n<p> <span><br />Basically, there’s no detail about what kind of game is this. I mean, It can be expansion for Touhou 10.5:Hishouten (Hence It’s name, Touhou Hisoutenshoku), or it can be a brand new game (since it’s not touhou 10.5 anymore). There’s a few theories about this, including it’s still Touhou 10.5 but, the timeframe advanced to be after Touhou 12, UFO.</p> </p>\n<p>\n  Well, whatever it is, feel free to imagine what do you want from it until further announcement. Anyway, from what I gathered from internet, It&#8217;s a full game, but you still need Touhou 10.5 to make it have the full cast (well, that&#8217;s not far different from what i call expansion -_-a)\n</p>\n<p>\n  New character is a must, And well, so far tasofro has leaked 3 of it&#8217;s character, namely:\n</p>\n<p>\n  <img src=\"http://www.tasofro.net/touhou123/th_img/f15.jpg\"><br>Sanae Kotiya/ Sanae Kochiya\n</p>\n<p>\n  <img src=\"http://www.tasofro.net/touhou123/th_img/f16.jpg\"><br>Cirno!!!!!\n</p>\n<p>\n  <img src=\"http://www.tasofro.net/touhou123/th_img/f17.jpg\"><br>China. er&#x2026;no. Chuugoku&#x2026; no? Whatever. It&#x2019;s Hong Meiling\n</p>\n<p>\n  And now about the cover&#8230;. Well, The last boss is always in the cover, if you follow the series. And it&#8217;s&#8230; CIRNO!!!!! well, I certainly don&#8217;t want to be killed by Cirno by founding that she&#8217;s more HAX than Reimu already is, well, Cirno is Teh Strongest after all (and no typo). There&#8217;s cirno ingame, so there&#8217;s high possibility that she&#8217;s the last boss. There&#8217;s won&#8217;t be official announcement about it (you must find it yourself, anyway).\n</p>\n<p>\n  Anyway, Like usual things from Touhou series. Just wait, play it and see it yourself (if you can, that is). I&#8217;ll try to snatch this game along with TH12 at this comiket. Until then, happy dreaming~\n</p>\n<p>\n  some extra (unconfirmed)\n</p>\n<p>\n  <img src=\"http://img31.imageshack.us/img31/928/1248593965970.jpg\"><br><img src=\"http://img353.imageshack.us/img353/9355/1248593863586.jpg\"><br><img src=\"http://img529.imageshack.us/img529/5431/1248593921801.jpg\"><br><img src=\"http://img93.imageshack.us/img93/9282/1248593766308.jpg\">\n</p>\n<p>\n  PS: And make my Hourai Ningyou a playable character, you damn tasofro.\n</p>\n<p>\n  Edit: Here&#8217;s from <a href=\"http://zip.4chan.org/jp/imgboard.html\">/jp/</a>\n</p>\n<p>\n  Main Story\n</p>\n<table border=\"1\">\n  <tr>\n    <td>\n      <span style=\"font-size: x-small\">That morning was a little dark, as if something was blocking the rays of the sun. Could it be because of the morning mist that had unexpectedly appeared in the middle of summer?</p> \n      \n      <p>\n        Having leapt out of your home into the mist you were expecting to let you forget about the heat, it is no wonder you would be startled to have that swaying “thing” appear before your eyes.\n      </p>\n      \n      <p>\n        This man-shaped “thing”, venting disgusting tepid steam, staggered forward as if gazing up at the mountain.\n      </p>\n      \n      <p>\n        –From up on the summery mountain, as hot and busy as it always was, she gazed down upon the man-shaped “thing”.</span></td> </tr> </tbody> </table> \n        \n        <p>\n          Sanae&#8217;s Story\n        </p>\n        \n        <table border=\"1\">\n          <tr>\n            <td>\n              <span style=\"font-size: x-small\">Two short years had passed since she first came to Gensokyo. At first, she was in such awe of its bizarre inhabitants that she couldn’t even perform her rituals properly, but now she was on friendly terms with them, and could perform her usual work just fine.<br />She thought she would not be surprised by anything any more. But of course, Gensokyo is the kind of place that will manage to startle anyone who believes so. That is one of Gensokyo’s strong points in comparison to the outside world.</p> \n              \n              <p>\n                From the Moriya Shrine, she had seen the shape of a giant man. It was taller by far than the shrine itself – in her own old-fashioned terms, it was on the scale of a ten-story highrise.\n              </p>\n              \n              <p>\n                To her, it looked like a giant robot from the anime she used to watch long ago.\n              </p>\n              \n              <p>\n                But for a robot, it moved too smoothly. It moved as if alive, sometimes looking longingly at the mountains, sometimes glaring down at the villages. And suddenly, it was wrapped in fog, disappearing in eery silence.\n              </p>\n              \n              <p>\n                When she informed Kanako of what she had seen, Kanako told her about the Spectre of the Brocken. The Spectre of the Brocken is a weather phenomenon where your own shadow is reflected in the mist as a seemingly giant figure.\n              </p>\n              \n              <p>\n                But no matter whether it actually was just a weather phenomenon, believing it was so would take all the fun out of your possible trains of thought. So she decided to believe it was a giant robot attacking the villages below. That way, it would be fun to investigate.\n              </p>\n              \n              <p>\n                Yes, this was definitely no shadow reflected in the mist. The mist had appeared after the man-shape, but most importantly, this was Gensokyo, a place where nothing, no matter how strange, is ever unexpected.<br /></span></td> </tr> </tbody> </table> \n                \n                <p>\n                  Cirno&#8217;s Story\n                </p>\n                \n                <table border=\"1\">\n                  <tr>\n                    <td>\n                      <span style=\"font-size: x-small\"><br />The little fairy was excited as ever. Today it was because she had seen that thing that was taller than a mountain.</p> \n                      \n                      <p>\n                        Of course, it was it was also further away than the mountains, so it wasn’t very big, but from looking at it, she felt there wasn’t much of a difference between them. It had quickly been enveloped in mist and she lost sight of it, but she was sure of what she’d seen. That was the great youkai Daidarabocchi, no doubt about it.\n                      </p>\n                      \n                      <p>\n                        With no idea where should stay, but filled with excitement at seeing such a rare youkai, the miko had left the youkai mountain.\n                      </p>\n                      \n                      <p>\n                        “Have you seen a giant ro… a large moving thing around here?” asked the miko, starting her search through the mist.\n                      </p>\n                      \n                      <p>\n                        The little fairy for some reason started feeling annoyed at this, and felt that since she had seen it first, it should belong to her.\n                      </p>\n                      \n                      <p>\n                        “Nope, haven’t seen Daidarabocchi at all!” she answered, to fool the miko.\n                      </p>\n                      \n                      <p>\n                        She had set out to search for the great youkai on her own, out of pure curiosity. <br /></span></td> </tr> </tbody> </table> \n                        \n                        <p>\n                          China&#8217;s Story\n                        </p>\n                        \n                        <table border=\"1\">\n                          <tr>\n                            <td>\n                              <span style=\"font-size: x-small\"><br />The Scarlet Devil Mansion was as busy that day as it always was. The gate keeper was giving a report to the mistress of the house, Remilia Scarlet, who was cheerfully paying it no attention.</p> \n                              \n                              <p>\n                                The gate keeper was feeling a vague sense of unease. During the morning, she had seen the shape of a giant man at the foot of the mountain. It had then vented tepid steam around it, and disappeared.\n                              </p>\n                              \n                              <p>\n                                What could it have been? It was as big as the giant bird Peng, and spewed ominous smoke. She was sure of it – it was the shape of Taisuei-shengjun, the Embodiment of Misfortune.\n                              </p>\n                              \n                              <p>\n                                Now all the youkai of Gensokyo must stand together and fight this evil god that has appeared in their midst, she reported to the mistress of the Scarlet Devil Mansion.\n                              </p>\n                              \n                              <p>\n                                Needless to say, her recommendation was not heeded.\n                              </p>\n                              \n                              <p>\n                                As she reflected later, she perhaps exaggerated a bit, in order to brighten up her dull everyday life a little. <br /></span></td> </tr> </tbody> </table> \n                                \n                                <p>\n                                  Source: <a href=\"http://www.tasofro.net/touhou123/index.html\"> tasofro </a><br /></span>\n                                </p>","frontmatter":{"title":"Touhou 12.3 : Touhou Hishoutenshoku"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2009-07-28-touhou-12-3-touhou-hishoutenshoku/"}}