{"data":{"markdownRemark":{"html":"<p>After waiting for more than a month (40 days, to be exact), I finally get my own Mastercard.</p>\n<p>This card was issued by <a href=\"http://www.payoneer.com/\">Payoneer</a> for free. Well, not actually free, they will get their payment when you’re loading cash to your card for the first time. To get their card, you need to be signed to their affiliate. There are many of them, search for yourself. I myself using <a href=\"http://friendfinder.com/\">Friendfinder</a> to get this one.</p>\n<p><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/DSCN279small.jpg\"><br>\nThe Envelope when it first come.</p>\n<p>It’s supposed to be arrived 15-20 days from when I signed up, but the long delay made me lost my hope for it. Well, but that’s it, The card come, so it’s all good. I have no complaint since it’s free.</p>\n<p><a href=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/DSCN2793copy.jpg\"><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/DSCN2793small.jpg\"></a><br>\nInside the envelope </p>\n<p>From what I read, this card can be filled by other Credit Card, or if you don’t have it, you can use Western Union (many bank offer this service) to fill it. And no, I won’t load cash to my card soon, since the exchange rate for USD has been crazy lately.</p>\n<p>The reason I applied this card is for activating <a href=\"http://www.paypal.com/\">Paypal</a> and to buy things aboard. Before, I used my parent’s Visa card to get things I want to buy (I don’t have one myself, poor me >.&#x3C;). As of now, I'm living in separated city, so, borrowing their card is no longer an option for me. That's why I'm looking one that don't need any requirements to apply (you need to have a decent income/ parent's approval to get a Credit Card, which I have none of them. My parents against me having a credit card).</p>\n<p>Why do I compare this card with a credit card? Ok, screw this thing. The only thing I need is their “MasterCard” ability. For your information, there’s no debit card in my country that support either Visa/Visa Electron/MasterCard. You must have credit card to have the service. So basically, I can’t buy anything outside my country unless i have credit card on my hand. On the other hand, this payoneer card is a debit card and it has MasterCard ability, so this thing will make me able to buy things outside my country without having a debit card.</p>\n<p>PS: My parents don’t know that now I have this card on my hand…. If they read this, then I’m screwed :/me running away~:</p>","frontmatter":{"title":"Finally, My Master Card Arrives"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2008-10-31-finally-my-master-card-arrives/"}}