{"data":{"markdownRemark":{"html":"<p>This guide is made for Trass from <a href=\"http://colorfulacronia.blogspot.com/\">colorfulacronia</a> (i made this directly after his request, so i kinda remember, usually i just forget the requester *shot*). This skill point can be used for either base, 2nd job, and 3rd job and revolves on talking to npc around carmine brick.  </p>\n<p>Side note: I need to get sphinx-chan ;_;</p>\n<p>Basically for this quest, you need to talk with . This quest starts from beach/coast and go until the carmine brick ruins.</p>\n<p>1. Talk to ディディ and ファド in coast, they will ask you for 2 ヒエヒエ石, this item can be bought at merchant nearby, it is a blue colored stone, the npc will sell it along with whistle.</p>\n<p>2. Talk to ディディ and ファド in desert, they are located just outside the coast (when you leave coast, immediately see your right, they'll be there). They'll ask for 2 mineral water - you should know where to buy this thing.</p>\n<p>3. Talk to ディディ and ファド in oasis - noon, if you somehow reach oasis in night, just go to one of the camp there that provide inn untill it's morning</p>\n<p>4. Talk to ディディ and ファド in carmine brick ruins 1F, from here onwards, just choose every choice (reccomended to starts from the top choice, talk again, second choice, and so on) until they leave. remember which choice you already choose, you don't need to repeat the answer.</p>\n<p>5. Talk to ディディ and ファド in carmine brick 1F - East Wing (or whatever the name), it's position is on the east portal from 1F.</p>\n<p>6. Talk to ディディ and ファド in carmine brick 2F, this map is located north-center of 1F map.</p>\n<p>7. Talk to ディディ and ファド in carmine brick B1F, they'll move around these part, i'll just give you the pic along with maps where they'll appear.</p>\n<p>1st B1F: Upper left</p>\n<p>2nd B1F: Upper right</p>\n<p>3rd B1F: Center</p>\n<p>Last one: North</p>\n<p> At this last spot, you will be asked where to put your free skill point, for example, i plan to put mine into chronicle job (third job). Along with this, you'll also get alladin's lamp furniture (blue), you can change the color via npc in the city later.</p>\n<p>I guess that's it. There might be other skill point quest that i'm not aware of. If you have any question go ahead and ask, if you're looking on how to get into oasis, see my previous post about carmine brick desert map.</p>","tableOfContents":"","frontmatter":{"title":"Carmine Brick - Free Skill Point Quest","url":null,"date":"2013 August 26"},"fields":{"path":"/post/2013-08-26-carmine-brick-free-skill-point-quest/"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2013-08-26-carmine-brick-free-skill-point-quest/","layout":"post"}}