{"data":{"markdownRemark":{"html":"<p>Animonster is an anime magazine in my country. What’s wrong with them? and what relationship they have with touhou? Well, it’s about their latest magazine (september ’08 Release)<br>\n<img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/Image024.jpg\"><br>\nCosts about 3$… but i don’t buy it… I rent them somewhere for 0.3$.. don’t want to spend any money for this trash.<br>\nThe place where i rent them won’t be shown for safety reason</p>\n<p>They include a bonus DVD with Wallpaper, Trailer, etc….</p>\n<p><img src=\"http://i485.photobucket.com/albums/rr211/Hourai/myblog/Image025.jpg\"><br>\nThe mentioned DVD…</p>\n<p>The problem lies within the DVD… They are using one of touhou’s remix, “天空の花の都” (The Capital City of Flowers in the Sky), Remix of song with the same title from Perfect Cherry Blossom Stage 4, By Sepia from SJV-SC circle, in the album called DIVIT (thanks to Gunbazca in <a href=\"http://aoindonesia.net/\">AOI</a> for mentioning it, and he also ask funkies from <a href=\"http://pooshlmer.com/wakaba/\">pooshlmer</a> about the what the song is).They Use it in their bonus DVD without even mentioning anything, not a single thing. There’s no touhou, no ZUN, no Team Shanghai Alice, and of course, they don’t give a credit at all to the maker. They Just use it without mentioning anything.<br>\nIt’s not the first time they are piracing songs and such. But since this time is touhou related, which is my main interest for now, i feel that i need to point it out.</p>\n<p>One thing to mention, I believe everything published by Megindo (at least, Gamestation and Animonster) is rubbish and not even worth reading. For the case of gamestation, they just copy paste-ing data from gamefaqs for their walkthrough section, translating it to Indonesian, and give no damn credit for the maker, not even a mail stating that they use the walkthrough, claiming it’s their work (I’m one of the victim some years ago). And yeah… at that time I already tried to contact their Customer Service Complaining about how they pirating my works, but they shut the phone immediately.</p>\n<p>This kind of thing has been very common in Indonesia. Now, there are many TV Program here who’s using BGM from game/anime as they please, with… of course, no credit. This kind of thing is one of the reason why Indonesia will never be able to do some advancement (I don’t care about it anymore, though…. since it’s really hopeless). That’s it for today.</p>","frontmatter":{"title":"Well now… Animonster do it again…"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2008-09-21-well-now-animonster-do-it-again/"}}