{"data":{"markdownRemark":{"html":"<p>Actually, there's a few more gathering between this and last post, but there's nothing new there, so, I won't bother writing about that. This time, there's many new item, and almost all members comes, so it's time to post it again.<br>\nAll pic posted here is from Xphile.  </p>\n<p><img src=\"images/DSC_9937.JPG\"><br>\nLeft to right:Xphile, Shiroa, Pitom, Diboy, Alvon, nagnecagn, Antidote, Hourai Ningyou, RayZLight  </p>\n<p><img src=\"images/DSC_9874.JPG\"><br>\n<img src=\"images/DSC_9875.JPG\"><br>\n<img src=\"images/DSC_9877.JPG\"><br>\nHeadphones, and amps, the last pic is the table where we roll opamps.  </p>\n<p><img src=\"images/DSC_9900.JPG\"><br>\nSenheisser HD414, too bright for my taste.  </p>\n<p><img src=\"images/DSC_9918.JPG\"><br>\ndiboy, listening to Grado SR60, well, some of you might already know this guy.  </p>\n<p><img src=\"images/DSC_9892.JPG\"><br>\nMy own Amps, Zigis, using D2 Viper's opamp, it's sound is freakishly good when paired with etymotic ER4S.  </p>\n<p><img src=\"images/DSC_9884.JPG\"><br>\nSoul Mini, with 3 opamps and 1 buffer. Good sound, but too pricey which is not worth it.  </p>\n<p>Random conversation by diboy :<br>\n_\"promonya ada apa aja mbak\"<br>\n\"ada promo buy 1 get 1 ama upsize\"<br>\n\"yang promo dapet mbaknya ada ga ?\"<br>\n(blushing, and then starting to chat with random topic)<br>\n\"paling enak kalo mau nonton beli minum di sini dulu.. trus nonton\"<br>\n\"o0o jadi kalo mau nonton beli minum di sini.. dapet mbaknya...\"<br>\n(blushing again)<br>\n_  </p>\n<p>That's it for now. Off topic note, I'm still unsure what kind of blog this blog will be. Some friends suggests that I should make this blog reviewing about Touhou music, well, that's not a bad idea, since funkies is broken and nowhere to be found. I'll try to make some, and see how well it goes.</p>","tableOfContents":"","frontmatter":{"title":"Audiophile-id   East Java  - May gathering-","url":null},"fields":{"path":"/post/2009-05-09-audiophile-id-east-java-may-gathering/"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2009-05-09-audiophile-id-east-java-may-gathering/","layout":"post"}}