{"data":{"markdownRemark":{"html":"<p><span>I’m back… sort of.</span><br>\n<span>First of all, I’m very sorry regarding my promise to fix the ECO registration guide. I have fixed them on the same link/post as before, which is <a href=\"http://hourai.etealune.net/blog/how-to-play-emil-chronicle-online-japanese-server/\">How to play ECO Japan</a>. I have removed those long picture based guide and replaced them with video instead. My consideration is that you supposed to be able to stream decently (or if you can’t manage to stream, I don’t really think your connection will be enough to connect to ECOJP to begin with – downloading client and stuffs).</span></p>\n<div style=\"clear: both;text-align: center\">\n  <span><a href=\"http://3.bp.blogspot.com/-TdTufq5-wkI/U0qhQabCfNI/AAAAAAAAEGs/r13sUD66mW8/s1600/Screen+Shot+2014-04-13+at+10.37.24+PM.png\" style=\"margin-left: 1em;margin-right: 1em\"><img border=\"0\" src=\"http://3.bp.blogspot.com/-TdTufq5-wkI/U0qhQabCfNI/AAAAAAAAEGs/r13sUD66mW8/s1600/Screen+Shot+2014-04-13+at+10.37.24+PM.png\">&#xA0;</a></span>\n</div>\n<div style=\"clear: both;text-align: center\">\n</div>\n<p><a name='more'></a><span>Personally, I prefer video tutorial rather than pictorial one. But if you prefer pictorial rather than video, please comment me here (or in tutorial page, whichever fine) and if there’s enough demand, I will reupload the pictorial version of the guide. Again, sorry for breaking my promise. I get pretty busy with stuffs to the point creating guide is out of question until just recently.</span><br>\n<span><br /></span><span>Several people asked why I become inactive. Well, currently I’m currently abroad from my country to achieve master degree. I got scholarship sponsored by an university in Taiwan. So as of now, I’m stuck on foreign country with zero knowledge on Chinese – Mandarin language. Things has been quite better lately that I finally can manage my time here, so I decide to fix the most crucial things people looking on this website. I think I can continue to fix the site while posting new stuff more frequently after this, but don’t really count on it.</span></p>\n<div style=\"clear: both;text-align: center\">\n  <a href=\"http://3.bp.blogspot.com/-x6GjjKj-DO4/UzdxOTZQ_CI/AAAAAAAADZ8/nif2-parcEY/s1600/DSC00561.JPG\" style=\"margin-left: 1em;margin-right: 1em\"><img border=\"0\" src=\"http://3.bp.blogspot.com/-x6GjjKj-DO4/UzdxOTZQ_CI/AAAAAAAADZ8/nif2-parcEY/s1600/DSC00561.JPG\" height=\"360\" width=\"640\"></a>\n</div>\n<div style=\"text-align: center\">\n  &nbsp;<span style=\"font-size: x-small\">My current workspace</span>\n</div>\n<p>That being said, my current project is to draw/create something using Live2D, which have no relation with ECO at all, so it’s quite possible that I’m still not as active, at least not as frequent as I used to be. I still need to raise my char to job 110 though, so I will *at least* online from time to time where the time permits. Maybe that’s all for now. If you have anything to ask, feel free to comment here, as always. I might not reply messages on time, but if I’m checking, I will definitely answer them.</p>\n<p>Regards,<br>\n~Hourai Etealune~<br>\n<span><br /></span><span><br /></span></p>","tableOfContents":"","frontmatter":{"title":"Sorry for the hiatus :(","url":"/blog/sorry-for-the-hiatus/"},"fields":{"path":"/post/2014-04-13-sorry-for-the-hiatus/"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2014-04-13-sorry-for-the-hiatus/","layout":"post"}}