{"data":{"markdownRemark":{"html":"<p>Long story short, I chat with my friend and he end up asking why people buying pirate oath at outrageous price. It seems odd to me that he doesn't know how the npc's pricing. Then i ask him, where did you sell all your item, he said that he throw it on acropolis's guild merchant, and the unsoldable one to trash bin *insert facepalm*. After some asking here and there, it seems many people also don't know about it.  </p>\n<p>Well, for you who don't know, NPC's in ECO actually have different pricing rate and selling caps, depends on where do you sell it. Here I will mention some of it. There might be more somewhere, but just search for it yourself.  </p>\n<p>First is your standard,Acropolis's guild merchant. For the sake of simplicity, I'm using several items,<br>\n1. Acropolis pass (1000G) this is used to easily identify how much npc pay for an item<br>\n2. nymph marioneette, tower shield, halberd, and sturm arms claw to see how much the caps for selling items.  </p>\n<p>Here we see that acro's guild merchant won't accept anything higher than around 4000G. Common mistake is that people tend to consider that all npc will also not accept these items and sent the items to trash. Some also don't know that other npcs will take the item for higher price.  </p>\n<hr>\n<p>Right now, I'm on Heated stone merchant, which is located at north plateau. He buys our item for 1.2 times acro's price which is quite nice. Note that you can also sell halberd here, which can't be sold previously at acro. It still won't accept sturm arm though.  </p>\n<hr>\n<p>Next place is at Igloo, He buys items at whopping 1.5 times of original price, this is where people usually sells the pirate oath. The downside of this place is, he can't accept anything higher than 3000G, which is quite a letdown.  </p>\n<hr>\n<p>Guild merchant in Enigma does accept items in normal price, but here, you can sell item up to maybe 20.000-30.000 golds which is far better than send it to trash bin.  </p>\n<hr>\n<p>A bit of extra, well, I'm not sure why this guild merchant exist to buy items. It really won't accept my item that's higher than 0 gold o3o.  </p>\n<p>That's all for today. There might be - or might be not - any other npc who buys at higher price. Just search it for yourself. If you do have time to separate items and such, I suggest to sell items to appropriate NPC (using merchant, of course, to maximize what you can sell). I feel bad for potential golds that went to trash because of ignorance. Just give it to me instead throwing it to trash o3o.  </p>","tableOfContents":"","frontmatter":{"title":"[ECO] Selling Things","url":null,"date":"09 August 2012"},"fields":{"path":"/post/2012-08-09-eco-selling-things/"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/2012-08-09-eco-selling-things/","layout":"post"}}